package com.mcs.liberation;

import android.app.*;
import android.os.*;
import android.content.*;
import android.view.*;
import android.widget.*;

public class History extends Activity
{
	//String list[]={};
	ListView lv;
	
	TextView tv,tv2;
	
	@Override
	protected void onCreate(Bundle BNDL)
	{
		super.onCreate(BNDL);
		getActionBar().hide();
		getWindow().addFlags(WindowManager.LayoutParams.FLAG_KEEP_SCREEN_ON);
		
		Storage store = new Storage(this);
		int i = store.getOpt();
		
		if(i==0){
			setHistory();
		}else if(i==2){
			setMujib();
		}else if(i==4){
			setBir();
		}
		
		
	}
	
	public void setBir(){
		
		setContentView(R.layout.bir);
		tv=(TextView)findViewById(R.id.aboutbir);
		tv.setText("বীর শ্রেষ্ঠ বীরত্বের জন্য প্রদত্ত বাংলাদেশের সর্বোচ্চ সামরিক পদক। যুদ্ধক্ষেত্রে অতুলনীয় সাহস ও আত্মত্যাগের নিদর্শন স্থাপনকারী যোদ্ধার স্বীকৃতিস্বরূপ এই পদক দেয়া হয়। বাংলাদেশের স্বাধীনতা যুদ্ধে শহীদ সাতজন মুক্তিযোদ্ধাকে এই পদক দেয়া হয়েছে ।"
            +"গুরুত্বের ক্রমানুসারে বীরত্বের জন্য প্রদত্ত বাংলাদেশের অন্যান্য সামরিক পদক হল - বীর উত্তম, বীর বিক্রম ও বীর প্রতীক। ১৯৭১ সালে মুক্তিযুদ্ধের পরই এই পদকগুলো দেয়া হয়। ১৯৭৩ সালের ১৫ ডিসেম্বর বাংলাদেশ গেজেটের একটি অতিরিক্ত সংখ্যায় প্রকাশিত বিজ্ঞপ্তির মাধ্যমে এই পদকপ্রাপ্তদের নাম ঘোষণা করা হয়। ");
	}
	
	public void setMujib(){
		
		setContentView(R.layout.mujib);
		tv = (TextView)findViewById(R.id.mujibTextView);
		tv.setText("শেখ মুজিবুর রহমান (১৭ মার্চ ১৯২০ - ১৫ আগস্ট ১৯৭৫) বাংলাদেশের প্রথম রাষ্ট্রপতি ও ভারতীয় উপমহাদেশের একজন অন্যতম প্রভাবশালী রাজনৈতিক ব্যক্তিত্ব যিনি বাঙালীর অধিকার রক্ষায় ব্রিটিশ ভারত থেকে ভারত বিভাজন আন্দোলন এবং পরবর্তীতে পূর্ব পাকিস্তান থেকে বাংলাদেশ প্রতিষ্ঠার সংগ্রামে নেতৃত্ব প্রদান করেন। প্রাচীন বাঙ্গালি সভ্যতার আধুনিক স্থপতি হিসাবে শেখ মুজিবুর রহমানকে বাংলাদেশের জাতির জনক বা জাতির পিতা বলা হয়ে থাকে। তিনি মাওলানা আব্দুল হামিদ খান ভাসানী প্রতিষ্ঠিত আওয়ামী লীগের সভাপতি, বাংলাদেশের প্রথম রাষ্ট্রপতি এবং পরবর্তীতে এদেশের প্রধানমন্ত্রীর দায়িত্ব পালন করেন। জনসাধারণের কাছে তিনি শেখ মুজিব এবং শেখ সাহেব হিসাবে বেশি পরিচিত এবং তার উপাধি বঙ্গবন্ধু। তার কন্যা শেখ হাসিনা বাংলাদেশ আওয়ামী লীগের বর্তমান সভানেত্রী এবং বাংলাদেশের বর্তমান প্রধানমন্ত্রী।  ১৯৪৭-এ ভারত বিভাগ পরবর্তী পূর্ব পাকিস্তানের রাজনীতির প্রাথমিক পর্যায়ে শেখ মুজিব ছিলেন তরুন ছাত্রনেতা।পরবর্তীতে তিনি মাওলানা আব্দুল হামিদ খান ভাসানী প্রতিষ্ঠিত আওয়ামী লীগের সভাপতি হন । সমাজতন্ত্রের পক্ষসমর্থনকারী একজন অধিবক্তা হিসেবে তিনি তৎকালীন পূর্ব পাকিস্তানের জনগোষ্ঠীর প্রতি সকল ধরণের বৈষম্যের বিরুদ্ধে আন্দোলন গড়ে তোলেন। জনগণের স্বাধিকার প্রতিষ্ঠার লক্ষ্যে তিনি একসময় ছয় দফা স্বায়ত্ত্বশাসন পরিকল্পনা প্রস্তাব করেন যাকে পশ্চিম পাকিস্তানে একটি বিচ্ছিন্নতাবাদী পরিকল্পনা হিসেবে বিবেচনা করা হয়েছিল। ছয় দফা দাবীর মধ্যে প্রধান ছিল বর্ধিত প্রাদেশিক স্বায়ত্তশাসন যার কারণে তিনি আইয়ুব খানের সামরিক শাসনের অন্যতম বিরোধী পক্ষে পরিণত হন। ১৯৬৮ খ্রিস্টাব্দে ভারত সরকারের সাথে যোগসাজশ ও ষড়যন্ত্রের অভিযোগে তার বিচার শুরু হয় এবং পরবর্তীতে তিনি নির্দোষ প্রমাণিত হন। ১৯৭০ খ্রিষ্টাব্দের নির্বাচনে তার নেতৃত্বাধীন আওয়ামী লীগ বিপুল বিজয় অর্জন করে। তথাপি তাকে সরকার গঠনের সুযোগ দেয়া হয় নি।  পাকিস্তানের নতুন সরকার গঠন বিষয়ে তৎকালীন রাষ্ট্রপতি ইয়াহিয়া খান এবং পশ্চিম পাকিস্তানের রাজনীতিবিদ জুলফিকার আলী ভুট্টোর সাথে শেখ মুজিবের আলোচনা বিফলে যাওয়ার পর ১৯৭১ খ্রিষ্টাব্দে মার্চ ২৫ মধ্যরাত্রে পাকিস্তান সেনাবাহিনী ঢাকা শহরে গণহত্যা পরিচালনা করে। একই রাতে তাকে গ্রেফতার করা হয় এবং পরবর্তীকালে পশ্চিম পাকিস্তানে নিয়ে যাওয়া হয়।[১] রহিমুদ্দিন খান সামরিক আদালতে তাকে মৃত্যুদণ্ড প্রদান করে তবে তা কার্যকরা হয় নি। ৯ মাসের রক্তক্ষয়ী মুক্তিযুদ্ধ শেষে ১৯৭১-এর ১৬ই ডিসেম্বর বাংলাদেশ-ভারত যৌথ বাহিনীর কাছে পাকিস্তান সেনাবাহিনী আত্মসমর্পণ করার মধ্য দিয়ে বাংলাদেশ নামে স্বাধীন রাষ্ট্রের প্রতিষ্ঠা হয়। ১০ জানুয়ারি ১৯৭২ শেখ মুজিব পাকিস্তানের কারাগার থেকে মুক্ত হয়ে স্বদেশে প্রত্যাবর্তন করেন এবং বাংলাদেশের প্রথম রাষ্ট্রপতি হিসেবে দায়িত্ব পালন শুরু করেন। পরবর্তীকালে তিনি প্রধানমন্ত্রী হন। সমাজতন্ত্র ও ধর্মনিরপেক্ষতাকে ভিত্তি করে সংবিধান প্রণয়ন এবং সে অনুযায়ী রাষ্ট্র চালনার চেষ্টা সত্ত্বেও তীব্র দারিদ্র্য, বেকারত্ব, সর্বব্যাপী অরাজকতা এবং সেই সাথে ব্যাপক দুর্নীতি মোকাবেলায় তিনি কঠিন সময় অতিবাহিত করেন। ক্রমবর্ধমান রাজনৈতিক অস্থিরতা দমনের লক্ষ্যে ১৯৭৫ খ্রিস্টাব্দে তিনি সকল দলীয় রাজনীতি নিষিদ্ধ ঘোষণা করে নিজেকে আজীবনের জন্য রাষ্ট্রপতি ঘোষণা করেন। এর সাত মাস পরে, ১৯৭৫ সালের ১৫ আগস্ট তারিখে একদল সামরিক কর্মকর্তার হাতে তিনি  ");
		
	}
	
	public void setHistory(){
		
		setContentView(R.layout.history);
		
		tv = (TextView)findViewById(R.id.historyTextView);
		tv2 = (TextView)findViewById(R.id.historyTextView2);
		
		tv.setText("পটভূমি : \n১৯৪৭ সালের আগস্ট মাসে ব্রিটিশ শাসনাধীন ভারতীয় উপমহাদেশ স্বাধীন হয় এবং ভারত বিভক্ত হয়ে দুটি পৃথক স্বাধীন রাষ্ট্রের জন্ম হয়। মুসলিম অধ্যুষিত এলাকা নিয়ে গঠিত হয় পাকিস্তান এবং হিন্দু ও অন্যান্য ধর্মাবলম্বী অধ্যুষিত অঞ্চল নিয়ে গঠিত হয় ভারত। নবগঠিত রাষ্ট্র পাকিস্তান দুই হাজার মাইলের ব্যবধানে অবস্থিত দুটি প্রদেশের সমন্বয়ে গঠিত হয় - পূর্ব পাকিস্তান (অধুনা বাংলাদেশ) ও পশ্চিম পাকিস্তান। ভৌগোলিক ও সাংস্কৃতিক দিক দিয়ে যোজন যোজন ব্যবধানে অবস্থিত এ দুটি অংশের মধ্যে মিল ছিল কেবল সংখ্যাগরিষ্ঠ মানুষের ধর্মে। পাকিস্তানের জন্মলগ্ন থেকেই এর পূর্ব অংশ পশ্চিম অংশের তুলনায় নানাভাবে বঞ্চিত হতে থাকে এবং স্বাধীন বাংলাদেশের জন্মের আগ পর্যন্ত দীর্ঘ ২৩ বছর ছিল পশ্চিম পাকিস্তান কর্তৃক পূর্ব পাকিস্তানকে শোষণ-বঞ্চনার ইতিহাস।"
				   +"\n\nপাকিস্তানের সাধারণ নির্বাচন, ১৯৭০ : \n নির্বাচনে মোট ২৪ টি দল অংশ নেয়। ৩০০ টি আসনে মোট ১,৯৫৭ জন প্রার্থী অংশগ্রহণ করার জন্য মনোনয়নপত্র জমা দেয়। এর পর কিছু প্রার্থী তাদের প্রার্থীতা প্রত্যাহার করে নেয়। মনোনয়নপত্র বাছাই শেষে ১,৫৭৯ জন প্রার্থী নির্বাচনে প্রতিদ্বন্দীতা করে। আওয়ামী লীগ ১৭০ আসনে প্রার্থী দেয়। এর মধ্যে ১৬২টি আসন পূর্ব পাকিস্তানে এবং অবশিষ্টগুলি পশ্চিম পাকিস্তানে। জামায়াতে ইসলামী দ্বিতীয় সর্বোচ্চ সংখ্যক প্রার্থী দেয়। তাদের প্রার্থী সংখ্যা ১৫১। পাকিস্তান পিপলস পার্টি মাত্র ১২০ আসনে প্রার্থী দেয়। তার মধ্যে ১০৩ টি ছিল পাঞ্জাব ও সিন্ধু প্রদেশে। পূর্ব পাকিস্তানে তারা কোন প্রার্থী দেয়নি। পিএমএল (কনভেনশন) ১২৪ আসনে, পিএমএল (কাউন্সিল) ১১৯ আসনে এবং পাকিস্তান মুসলিম লীগ (কাইয়ুম) ১৩৩ আসনে প্রতিদ্বন্দীতা করে। নির্বাচনে জনগণের ব্যাপক অংশগ্রহণ এবং প্রায় ৬৫% ভোট পড়েছে বলে সরকার দাবী করে। সর্বমোট ৫৬,৯৪১,৫০০ রেজিস্টার্ড ভোটারের মধ্যে ৩১,২১১,২২০ জন পূর্ব পাকিস্তানের এবং ২৩,৭৩০,২৮০ জন ছিল পশ্চিম পাকিস্তানের ভোটার।");
		
       tv2.setText("মুজিব-ইয়াহিয়া বৈঠক সারা দেশ যখন ক্ষোভে উত্তাল, তখন ইয়াহিয়া খান ঢাকায় এসে শেখ মুজিবের সঙ্গে সরকার গঠন ও ক্ষমতা হস্তান্তরের ব্যাপারে আলোচনা শুরু করেন। কিন্তু একই সঙ্গে সামরিক বাহিনী পূর্ব পাকিস্তানে গণহত্যা চালানোর পূর্বপ্রস্তুতি গ্রহণ করতে থাকে। বেলুচিস্তানের কসাই হিসেবে পরিচিত জেনারেল টিক্কা খানকে পূর্ব পাকিস্তানের গভর্নর হিসেবে ঢাকায় প্রেরণ করা হয়, কিন্তু কোন বাঙালি বিচারপতি তাঁকে শপথ পাঠ করাতে রাজি হন নি। পূর্ব পাকিস্তানে সৈন্য ও অস্ত্রশস্ত্র আনা হতে থাকে। ১০ থেকে ১৩ মার্চের মধ্যে পাকিস্তান এয়ারলাইন্স তাদের সব আন্তর্জাতিক ফ্লাইট বাতিল করে পূর্ব পাকিস্তানে জরুরীভিত্তিতে সরকারি যাত্রী পরিবহণ করতে। এই সরকারি যাত্রী দের প্রায় সবাই ছিল সাদা পোশাকে পাকিস্তানি সামরিক বাহিনীর সেনা। এমভি সোয়াত নামে গোলাবারুদ ও অস্ত্রশস্ত্র বোঝাই একটি পাকিস্তানি জাহাজ চট্টগ্রাম বন্দরে ভেড়ে। কিন্তু বন্দরের নাবিক ও শ্রমিকেরা মালামাল খালাস করতে অস্বীকার করে। ইস্ট পাকিস্তান রাইফেলসের একটি দল বাঙালি প্রতিবাদকারীদের ওপর গুলি চালাতে অস্বীকার করে, যার মাধ্যমে শুরু হয় বাঙালি সৈনিকদের বিদ্রোহ। অনেক আশা সত্বেও মুজিব-ইয়াহিয়া বৈঠক সফল হয় নি। ২৫ মার্চ রাতে পাকিস্তানের রাষ্ট্রপতি ইয়াহিয়া খান পাকিস্তানি সামরিক বাহিনীকে বাঙালি নিধনযজ্ঞের সবুজ সংকেত প্রদান করে সন্ধ্যায় গোপনে পশ্চিম পাকিস্তান যাত্রা করেন। গণহত্যা ও জনযুদ্ধের সূত্রপাত"
		+"মূল নিবন্ধ: ১৯৭১ সালের বাংলাদেশ গণহত্যা"
		+"২৫শে মার্চ রাতে পাকিস্তানি সামরিক বাহিনী শুরু করে অপারেশন সার্চলাইট নামের গণহত্যাযজ্ঞ। এশিয়া টাইমসের ভাষ্য অনুযায়ী,"
		+"সামরিক বাহিনীর বড় বড় অফিসারদের নিয়ে বৈঠকে ইয়াহিয়া খান ঘোষণা করেন তিরিশ লক্ষ বাঙালিকে হত্যা করো, তখন দেখবে বাকিরা আমাদের হাত চেটে খাবে। সে পরিকল্পনা মতোই ২৫ মার্চ রাতে পাকিস্তানি সেনাবাহিনী অপারেশন সার্চলাইট আরম্ভ করে যার উদ্দেশ্য ছিল বাঙালি প্রতিরোধ গুঁড়িয়ে দেয়া। এরই অংশ হিসাবে সামরিক বাহিনীর বাঙালি সদস্যদের নিরস্ত্র করে হত্যা করা হয়, ছাত্র ও বুদ্ধিজীবীদের নিধন করা হয় এবং সারা বাংলাদেশে নির্বিচারে সাধারণ মানুষ হত্যা করা হয়।"
		+"হত্যাকাণ্ডের খবর যাতে পৃথিবীর অন্যান্য দেশে না পৌঁছায় সে লক্ষ্যে ২৫ মার্চের আগেই বিদেশি সাংবাদিকদের ঢাকা পরিত্যাগে বাধ্য করা হয়। তারপরও সাংবাদিক সাইমন ড্রিং জীবনের ঝুঁকি নিয়ে ঢাকায় অবস্থান করে ওয়াশিংটন পোস্টের মাধ্যমে সারা পৃথিবীকে এই গণহত্যার খবর জানিয়েছিলেন। যদিও এই হত্যাযজ্ঞের মূল কেন্দ্রবিন্দু ছিল ঢাকা, বাঙালি হত্যা পুরো দেশজুড়ে চালানো হয়। ঢাকা বিশ্ববিদ্যালয়ের আবাসিক হলগুলো ছিল তাদের বিশেষ লক্ষ্য। একমাত্র হিন্দু আবাসিক হল - জগন্নাথ হল - পুরোপুরি ধ্বংস করে দেয় পাকিস্তানি সেনাবাহিনী। এতে ৬০০ থেকে ৭০০ আবাসিক ছাত্র নিহত হয়। যদিও পাকিস্তানি সেনাবাহিনী বিশ্ববিদ্যালয়ে কোনো ধরনের ঠাণ্ডা মাথার হত্যাকাণ্ডের কথা অস্বীকার করেছে, তবে হামিদুর রহমান কমিশনের মতে বিশ্ববিদ্যালয়ে পাকিস্তানি সেনাবাহিনী ব্যাপক শক্তি প্রয়োগ করেছিলো। জগন্নাথ হল এবং অন্যান্য ছাত্র হলগুলোতে পাকিস্তানিদের হত্যাযজ্ঞের চিত্র ভিডিওটেপে ধারণ করেন তদানীন্তন পূর্ব পাকিস্তান ইউনিভার্সিটি অব ইঞ্জিনিয়ারিং এন্ড টেকনলজি (বর্তমান বুয়েট) এর প্রফেসর নূরুল উলা।"
		+"পুরো বাংলাদেশেই হিন্দু এলাকাগুলো বিশেষ ক্ষতির সম্মুখীন হয়। মধ্যরাতের আগেই ঢাকা পুরোপুরি জ্বলছিল, বিশেষভাবে পূর্ব দিকের হিন্দুপ্রধান এলাকাগুলো। ২ আগস্ট, ১৯৭১ টাইম সাময়িকীর প্রতিবেদন অনুযায়ী, হিন্দুরা, যারা মোট শরণার্থীদের তিন-চতুর্থাংশ, পাকিস্তানি সামরিক বাহিনীর ক্রোধ ও আক্রোশ বহন করছিল "
		+"স্বাধীনতার ঘোষণা "
        +"টেক্সাসে বসবাসরত মুক্তিযোদ্ধা ও মুক্তিযুদ্ধ সম্পর্কিত নথি সংগ্রাহক মাহবুবুর রহমান জালাল বলেন, “বিভিন্ন সূত্র ও দলিল থেকে পাওয়া তথ্য অনুযায়ী এই প্রমাণিত হয় যে, ২৬ মার্চের প্রথম প্রহরে বাংলাদেশের স্বাধীনতার ঘোষণা দিয়েছিলেন বঙ্গবন্ধু শেখ মুজিবুর রহমান, যা ছিল তাঁর বা অন্য কারো হয়ে ঘোষণা দেয়ার অনেক পূর্বে।[২৮] ২৫ মার্চে মুজিব-ইয়াহিয়া বৈঠক ভেঙে গেলে ইয়াহিয়া গোপনে ইসলামাবাদে ফিরে যান। এবং গণহত্যা চালানোর পর[২৯] পাকিস্তানি সেনারা সেই রাতেই বঙ্গবন্ধুসহ তার পাঁচ বিশ্বস্ত সহকারীকে গ্রেপ্তার করে। [৩০] গ্রেপ্তার হওয়ার পূর্বে তিনি বাংলাদেশের স্বাধীনতার ঘোষণা লিখে যান। [৩১] মূল ঘোষণার অনুবাদ নিম্নরূপঃ "
		+"এটাই হয়ত আমার শেষ বার্তা, আজ থেকে বাংলাদেশ স্বাধীন। আমি বাংলাদেশের মানুষকে আহ্বান জানাই, আপনারা যেখানেই থাকুন, আপনাদের সর্বস্ব দিয়ে দখলদার সেনাবাহিনীর বিরুদ্ধে শেষ পর্যন্ত প্রতিরোধ চালিয়ে যান। বাংলাদেশের মাটি থেকে সর্বশেষ পাকিস্তানি সৈন্যটিকে উৎখাত করা এবং চূড়ান্ত বিজয় অর্জনের আগ পর্যন্ত আপনাদের যুদ্ধ অব্যাহত থাকুক। "
        +"বিভিন্ন মাধ্যমে ঘোষণাপত্র "
        +"২৫-শে মার্চ থেকে ঢাকার হোটেল ইন্টারকন্টিনেন্টালে অবস্থানরত সকল সাংবাদিককে পাকিস্তানি সামরিক বাহিনী ২ দিন যাবৎ অবরুদ্ধ করে রাখে।[৩২] স্বাধীন বাংলা বেতার কেন্দ্র [টীকা ১] সেখান থেকে ঘোষণা হয় যে “শেখ মুজিব পূর্ব পাকিস্তানে সাড়ে সাত কোটি জনগণকে স্বাধীন সার্বভৌম বাংলাদেশের নাগরিক হিসেবে ঘোষণা করেছেন”। গত তিন দশকের বেশি সময় ধরে স্বাধীনতার মূল ঘোষক কে ছিলেন তা নিয়ে ব্যাপক বিতর্কের সৃষ্টি হয়েছে। এই কারণে ১৯৮২ সালে সরকারিভাবে একটি ইতিহাস পুস্তক প্রকাশিত হয় যাতে ৩টি বিষয় উপস্থাপিত হয়।[৩৩] "
		+"শেখ মুজিবুর রহমান একটি ঘোষণাপত্র লিখেন ২৫ মার্চ মাঝরাত কিংবা ২৬ মার্চ প্রথম প্রহরে। "
		
		+"শেখ মুজিবুর রহমানের ঘোষণাপত্রটি ২৬ তারিখে স্বাধীন বাংলা বেতার কেন্দ্র থেকে প্রচারিত হয়। কিন্তু সীমিতসংখ্যক মানুষ সেই সম্প্রচারটি শুনেছিল। "
		+"পূর্ব বাংলা রেজিমেন্টের মেজর জিয়াউর রহমান বঙ্গবন্ধু শেখ মুজিবের হয়ে ২৭ মার্চ চট্টগ্রামের কালুরঘাট থেকে স্বাধীনতা ঘোষণা করেন। যা আন্তর্জাতিক গণমাধ্যম প্রচার করে, ফলে বিশ্ব বাংলাদেশের স্বাধীনতার ঘোষণা সম্পর্কে জানতে পারে। ঘোষণাটি ছিল নিম্নরূপঃ [৩৪] "

		+"On behalf of our great national leader, supreme commander of Bangladesh Sheikh Mujibur Rahman do hereby proclaim the independence of Bangladesh. It is further proclaimed that Sheikh Mujibur Rahman is sole leader of elected representatives of 75 million people of Bangladesh. I therefore appeal on behalf of our great leader Sheikh Mujibur Rahman to the government of all democratic countries of the world specially big world part and neighboring countries to take effective steps to stop immediately. The awful genocide that has been carried on by the army of occupation from Pakistan. The legally elected representatives of the majority of the people as repressionist, it is cruel joke and contradiction in terms which should be fool none. The guiding principle of a new step will be first neutrality, second peace and third friendship to all and anonymity to none. ─ May Allah help us, Jai Bangla.\nঅনুবাদঃ\n"
		+"আমাদের মহান নেতা, বাংলাদেশের সর্বাধিনায়ক শেখ মুজিবুর রহমানের হয়ে আমি বাংলাদেশের স্বাধীনতা ঘোষণা করছি। এটি আরও ঘোষণা করা হচ্ছে যে বাংলাদেশের সাড়ে সাত কোটি জনগণের নির্বাচিত জনপ্রতিনিধিদের একমাত্র নেতা হচ্ছেন শেখ মুজিবুর রহমান। আমি সেই কারণে আমাদের মহান নেতা শেখ মুজিবুর রহমানের হয়ে বিশ্বের সকল গণতান্ত্রিক রাষ্ট্র বিশেষ করে বৃহৎ বিশ্ব ও প্রতিবেশীদের কাছে কার্যকারী পদক্ষেপ নেয়ার জন্য অনুরোধ করছি। পাকিস্তানের সেনাবাহিনীর হামলার ফলে ভয়াবহ গণহত্যা শুরু হয়েছে। অধিকাংশ জনগণের বৈধভাবে নির্বাচিত জনপ্রতিনিধি নিপীড়নকারী, এটি একটি ক্রূর কৌতুক ও মিথ্যা অপবাদ যার কাউকে বোকা বানানো উচিত নয়। বিরোধ নিষ্পত্তির ক্ষেত্রে প্রধান পদক্ষেপগুলোর মধ্যে প্রথম হতে হবে নিরপেক্ষতা, দ্বিতীয় শান্তি এং তৃতীয় সকলের সাথে বন্ধুভাবপন্ন ও কারো সম্বন্ধে অজ্ঞানতা নয়। ─ আল্লাহ্ সহায় হোক, জয় বাংলা। "
		+"অস্থায়ী সরকার গঠন "
		+"১৯৭১ সালের ১৭ এপ্রিল মুক্তিযুদ্ধ পরিচালনার জন্য অস্থায়ী বাংলাদেশ সরকারের আনুষ্ঠানিক প্রতিষ্ঠা হয় কুষ্টিয়া জেলার মেহেরপুর মহকুমা (বর্তমানে জেলা) বৈদ্যনাথতলার অন্তর্গত ভবেরপাড়া (বর্তমান মুজিবনগর) গ্রামে। শেখ মুজিবুর রহমান এর অনুপস্থিতিতে তাঁকে রাষ্ট্রপতি করে সরকার গঠন করা হয়। অস্থায়ী রাষ্ট্রপতির দায়িত্ব নেন সৈয়দ নজরুল ইসলাম এবং প্রধানমন্ত্রীর দায়িত্ব অর্পিত হয় তাজউদ্দিন আহমদের উপর।[৩৫] বাংলাদেশের প্রথম সরকার দেশি-বিদেশি সাংবাদিকের সামনে শপথ গ্রহণ করে আনুষ্ঠানিকভাবে দায়িত্ব পালন শুরু করে। এই শপথ গ্রহণ অনুষ্ঠানে স্বাধীনতার ঘোষণাপত্র পাঠের মাধ্যমে ২৬ মার্চ হতে বাংলাদেশকে আনুষ্ঠানিকভাবে স্বাধীন সার্বভৌম রাষ্ট্র হিসাবে ঘোষণা করা হয়। "); 
				   
				   
				   /*
		lv = (ListView)findViewById(R.id.historyListView);
		ArrayAdapter aa = new ArrayAdapter(this,R.layout.listcontener,R.id.listcontenerTextView,list);
		lv.setAdapter(aa);
		
		lv.setOnItemClickListener(new AdapterView.OnItemClickListener(){

			@Override
			public void onItemClick(AdapterView<?> p1, View p2, int p3, long p4)
			{
			    Toast.makeText(getBaseContext(),"Select : "+p3,Toast.LENGTH_SHORT).show();
			}
		});
		
		*/
		
		
		
	}
	
	
	public void BACK(View v){
		this.finish();
	}
}
